AlmAck/svdtonuttx/demo/h/da1470x_lcdc.h
/****************************************************************************
 * ./tmp/da1470x_lcdc.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_LCDC_H
#define __DA1470X_LCDC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_LCDC_LCDC_BACKPORCHXY_OFFSET      0x001C /* Back Porch X and Y */
#define DA1470X_LCDC_LCDC_BGCOLOR_OFFSET          0x0008 /* Background Color */
#define DA1470X_LCDC_LCDC_BLANKINGXY_OFFSET       0x0018 /* Blanking X and Y */
#define DA1470X_LCDC_LCDC_CLKCTRL_CG_OFFSET       0x01A8 /* Controls the CLock Gaters and the routing of format and pixel clock */
#define DA1470X_LCDC_LCDC_CLKCTRL_OFFSET          0x0004 /* Clock Divider */
#define DA1470X_LCDC_LCDC_COLMOD_OFFSET           0x0100 /* Color mode status register */
#define DA1470X_LCDC_LCDC_CONF_OFFSET             0x00F0 /* Supported config */
#define DA1470X_LCDC_LCDC_CRC_OFFSET              0x0184 /* CRC check */
#define DA1470X_LCDC_LCDC_DBIB_CFG_OFFSET         0x0028 /* MIPI DBIB Config Register */
#define DA1470X_LCDC_LCDC_DBIB_CMD_OFFSET         0x00E8 /* MIPI DBIB Command Register */
#define DA1470X_LCDC_LCDC_DBIB_RDAT_OFFSET        0x00EC /* Data read by DBI Type-B/SPI interface */
#define DA1470X_LCDC_LCDC_FMTCTRL_2_OFFSET        0x01A4 /* DBI and JDI format control */
#define DA1470X_LCDC_LCDC_FMTCTRL_3_OFFSET        0x01AC /* JDI format control */
#define DA1470X_LCDC_LCDC_FMTCTRL_OFFSET          0x01A0 /* DBI and JDI format control */
#define DA1470X_LCDC_LCDC_FRONTPORCHXY_OFFSET     0x0014 /* Front Porch X and Y */
#define DA1470X_LCDC_LCDC_GPIO_OFFSET             0x002C /* General Purpose IO (8-bits) */
#define DA1470X_LCDC_LCDC_IDREG_OFFSET            0x00F4 /* Identification Register */
#define DA1470X_LCDC_LCDC_INTERRUPT_OFFSET        0x00F8 /* Interrupt Register */
#define DA1470X_LCDC_LCDC_LAYER0_BASEADDR_OFFSET  0x003C /* Layer0 Base Addr */
#define DA1470X_LCDC_LCDC_LAYER0_MODE_OFFSET      0x0030 /* Layer0 Mode */
#define DA1470X_LCDC_LCDC_LAYER0_RESXY_OFFSET     0x0044 /* Layer0 Res XY */
#define DA1470X_LCDC_LCDC_LAYER0_SIZEXY_OFFSET    0x0038 /* Layer0 Size XY */
#define DA1470X_LCDC_LCDC_LAYER0_STARTXY_OFFSET   0x0034 /* Layer0 Start XY */
#define DA1470X_LCDC_LCDC_LAYER0_STRIDE_OFFSET    0x0040 /* Layer0 Stride */
#define DA1470X_LCDC_LCDC_LAYER1_BASEADDR_OFFSET  0x005C /* Layer1 Base Addr */
#define DA1470X_LCDC_LCDC_LAYER1_MODE_OFFSET      0x0050 /* Layer1 Mode */
#define DA1470X_LCDC_LCDC_LAYER1_RESXY_OFFSET     0x0064 /* Layer1 Res XY */
#define DA1470X_LCDC_LCDC_LAYER1_SIZEXY_OFFSET    0x0058 /* Layer1 Size XY */
#define DA1470X_LCDC_LCDC_LAYER1_STARTXY_OFFSET   0x0054 /* Layer0 Start XY */
#define DA1470X_LCDC_LCDC_LAYER1_STRIDE_OFFSET    0x0060 /* Layer1 Stride */
#define DA1470X_LCDC_LCDC_MODE_OFFSET             0x0000 /* Display Mode */
#define DA1470X_LCDC_LCDC_PALETTE_255_OFFSET      0x07FC /* Global palette/gamma correction */
#define DA1470X_LCDC_LCDC_PALETTE_BASE_OFFSET     0x0400 /* Global palette/gamma correction */
#define DA1470X_LCDC_LCDC_RESXY_OFFSET            0x000C /* Resolution X,Y */
#define DA1470X_LCDC_LCDC_STARTXY_OFFSET          0x0024 /* Specifies the start position of the very first frame */
#define DA1470X_LCDC_LCDC_STATUS_OFFSET           0x00FC /* Status Register */

/* Register addresses *******************************************************/

#define DA1470X_LCDC_BASE                         0x30030000 /* LCDC registers */

#define DA1470X_LCDC_LCDC_BACKPORCHXY             (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_BACKPORCHXY_OFFSET) /* Back Porch X and Y */
#define DA1470X_LCDC_LCDC_BGCOLOR                 (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_BGCOLOR_OFFSET) /* Background Color */
#define DA1470X_LCDC_LCDC_BLANKINGXY              (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_BLANKINGXY_OFFSET) /* Blanking X and Y */
#define DA1470X_LCDC_LCDC_CLKCTRL_CG              (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_CLKCTRL_CG_OFFSET) /* Controls the CLock Gaters and the routing of format and pixel clock */
#define DA1470X_LCDC_LCDC_CLKCTRL                 (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_CLKCTRL_OFFSET) /* Clock Divider */
#define DA1470X_LCDC_LCDC_COLMOD                  (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_COLMOD_OFFSET) /* Color mode status register */
#define DA1470X_LCDC_LCDC_CONF                    (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_CONF_OFFSET) /* Supported config */
#define DA1470X_LCDC_LCDC_CRC                     (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_CRC_OFFSET) /* CRC check */
#define DA1470X_LCDC_LCDC_DBIB_CFG                (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_DBIB_CFG_OFFSET) /* MIPI DBIB Config Register */
#define DA1470X_LCDC_LCDC_DBIB_CMD                (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_DBIB_CMD_OFFSET) /* MIPI DBIB Command Register */
#define DA1470X_LCDC_LCDC_DBIB_RDAT               (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_DBIB_RDAT_OFFSET) /* Data read by DBI Type-B/SPI interface */
#define DA1470X_LCDC_LCDC_FMTCTRL_2               (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_FMTCTRL_2_OFFSET) /* DBI and JDI format control */
#define DA1470X_LCDC_LCDC_FMTCTRL_3               (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_FMTCTRL_3_OFFSET) /* JDI format control */
#define DA1470X_LCDC_LCDC_FMTCTRL                 (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_FMTCTRL_OFFSET) /* DBI and JDI format control */
#define DA1470X_LCDC_LCDC_FRONTPORCHXY            (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_FRONTPORCHXY_OFFSET) /* Front Porch X and Y */
#define DA1470X_LCDC_LCDC_GPIO                    (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_GPIO_OFFSET) /* General Purpose IO (8-bits) */
#define DA1470X_LCDC_LCDC_IDREG                   (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_IDREG_OFFSET) /* Identification Register */
#define DA1470X_LCDC_LCDC_INTERRUPT               (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_INTERRUPT_OFFSET) /* Interrupt Register */
#define DA1470X_LCDC_LCDC_LAYER0_BASEADDR         (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER0_BASEADDR_OFFSET) /* Layer0 Base Addr */
#define DA1470X_LCDC_LCDC_LAYER0_MODE             (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER0_MODE_OFFSET) /* Layer0 Mode */
#define DA1470X_LCDC_LCDC_LAYER0_RESXY            (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER0_RESXY_OFFSET) /* Layer0 Res XY */
#define DA1470X_LCDC_LCDC_LAYER0_SIZEXY           (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER0_SIZEXY_OFFSET) /* Layer0 Size XY */
#define DA1470X_LCDC_LCDC_LAYER0_STARTXY          (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER0_STARTXY_OFFSET) /* Layer0 Start XY */
#define DA1470X_LCDC_LCDC_LAYER0_STRIDE           (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER0_STRIDE_OFFSET) /* Layer0 Stride */
#define DA1470X_LCDC_LCDC_LAYER1_BASEADDR         (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER1_BASEADDR_OFFSET) /* Layer1 Base Addr */
#define DA1470X_LCDC_LCDC_LAYER1_MODE             (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER1_MODE_OFFSET) /* Layer1 Mode */
#define DA1470X_LCDC_LCDC_LAYER1_RESXY            (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER1_RESXY_OFFSET) /* Layer1 Res XY */
#define DA1470X_LCDC_LCDC_LAYER1_SIZEXY           (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER1_SIZEXY_OFFSET) /* Layer1 Size XY */
#define DA1470X_LCDC_LCDC_LAYER1_STARTXY          (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER1_STARTXY_OFFSET) /* Layer0 Start XY */
#define DA1470X_LCDC_LCDC_LAYER1_STRIDE           (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_LAYER1_STRIDE_OFFSET) /* Layer1 Stride */
#define DA1470X_LCDC_LCDC_MODE                    (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_MODE_OFFSET) /* Display Mode */
#define DA1470X_LCDC_LCDC_PALETTE_255             (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_PALETTE_255_OFFSET) /* Global palette/gamma correction */
#define DA1470X_LCDC_LCDC_PALETTE_BASE            (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_PALETTE_BASE_OFFSET) /* Global palette/gamma correction */
#define DA1470X_LCDC_LCDC_RESXY                   (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_RESXY_OFFSET) /* Resolution X,Y */
#define DA1470X_LCDC_LCDC_STARTXY                 (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_STARTXY_OFFSET) /* Specifies the start position of the very first frame */
#define DA1470X_LCDC_LCDC_STATUS                  (DA1470X_LCDC_BASE + DA1470X_LCDC_LCDC_STATUS_OFFSET) /* Status Register */

/* Register bit definitions *************************************************/


