AlmAck/svdtonuttx/demo/h/da1470x_lcdc.h
/* LCDC_BACKPORCHXY Register */

#define LCDC_BPORCH_X_MASK                        (0xFFFF << 16) /* Back porch X (pixel clocks) */
#define LCDC_BPORCH_X_POS                         (16) /* Back porch X (pixel clocks) */
#define LCDC_BPORCH_Y_MASK                        (0xFFFF << 0) /* Back porch Y (lines) */
#define LCDC_BPORCH_Y_POS                         (0) /* Back porch Y (lines) */

/* LCDC_BGCOLOR Register */

#define LCDC_BG_RED_MASK                          (0xFF << 24) /* Red color used as background. */
#define LCDC_BG_RED_POS                           (24) /* Red color used as background. */
#define LCDC_BG_GREEN_MASK                        (0xFF << 16) /* Green color used as background. */
#define LCDC_BG_GREEN_POS                         (16) /* Green color used as background. */
#define LCDC_BG_BLUE_MASK                         (0xFF << 8) /* Blue color used as background. */
#define LCDC_BG_BLUE_POS                          (8) /* Blue color used as background. */
#define LCDC_BG_ALPHA_MASK                        (0xFF << 0) /* Alpha color used as background. */
#define LCDC_BG_ALPHA_POS                         (0) /* Alpha color used as background. */

/* LCDC_BLANKINGXY Register */

#define LCDC_BLANKING_X_MASK                      (0xFFFF << 16) /* Blanking period X (HSYNC pulse length) */
#define LCDC_BLANKING_X_POS                       (16) /* Blanking period X (HSYNC pulse length) */
#define LCDC_BLANKING_Y_MASK                      (0xFFFF << 0) /* Blanking period Y (VSYNC lines) */
#define LCDC_BLANKING_Y_POS                       (0) /* Blanking period Y (VSYNC lines) */

/* LCDC_CLKCTRL_CG Register */

#define LCDC_LCDC_SWAP_PIX_FORMAT_CLK             (1U << 2) /* Pixel generation and format clock swap */
#define LCDC_LCDC_INV_CLK_POLARITY                (1U << 1) /* Invert (output) clock polarity */

/* LCDC_CLKCTRL Register */

#define LCDC_SEC_CLK_DIV_MASK                     (0x1F << 27) /* Secondary clock divider that generates the format pipeline clock. Source clock o */
#define LCDC_SEC_CLK_DIV_POS                      (27) /* Secondary clock divider that generates the format pipeline clock. Source clock o */
#define LCDC_DMA_HOLD_MASK                        (0x3F << 8) /* Hold time before DMA activated. */
#define LCDC_DMA_HOLD_POS                         (8) /* Hold time before DMA activated. */
#define LCDC_CLK_DIV_MASK                         (0x3F << 0) /* Clock divider that generates the pixel pipeline clock. Source clock of this divi */
#define LCDC_CLK_DIV_POS                          (0) /* Clock divider that generates the pixel pipeline clock. Source clock of this divi */

/* LCDC_COLMOD Register */

#define LCDC_COLMODES_MASK                        (0x1FFFF << 0) /* 16 bit: Indicates that the LUT8 color format is enabled 15 bit: Indicates that t */
#define LCDC_COLMODES_POS                         (0) /* 16 bit: Indicates that the LUT8 color format is enabled 15 bit: Indicates that t */

/* LCDC_CONF Register */

#define LCDC_CONF_MASK                            (0xFFFFFFFF << 0) /* 0 bit : Indicates that Global Gamma/Palette is enabled 1 bit : Indicates that fi */
#define LCDC_CONF_POS                             (0) /* 0 bit : Indicates that Global Gamma/Palette is enabled 1 bit : Indicates that fi */

/* LCDC_CRC Register */

#define LCDC_CRC_MASK                             (0xFFFFFFFF << 0) /* CRC check. */
#define LCDC_CRC_POS                              (0) /* CRC check. */

/* LCDC_DBIB_CFG Register */

#define LCDC_DBIB_INTERFACE_EN                    (1U << 31) /* When set to 1, the DBI Type-B interface is activated */
#define LCDC_DBIB_CSX_CFG_EN                      (1U << 30) /* When set to 1, the value of the CSX signal of the DBI Type-B interface can be co */
#define LCDC_DBIB_CSX_CFG                         (1U << 29) /* Sets the value of DBIB_CSX signal: CSX is set to one if DBIB_CFG[29] has the val */
#define LCDC_DBIB_TE_DISABLE                      (1U << 28) /* When set to 1, the DBIB_TE signal is disabled */
#define LCDC_SPI_DC_AS_SPI_SD1                    (1U << 27) /* When set to 1, enables the usage of SPI_DC wire as SPI_SD1 */
#define LCDC_DBIB_FORCE_IDLE                      (1U << 26) /* When set to 1, force DBI Type-B interface to idle state. Swap on the fly data fo */
#define LCDC_DBIB_RESX_OUT_EN                     (1U << 25) /* Drives DBIB_RESX output signal of DBI Type-B interface */
#define LCDC_SUB_PIXEL_REVERSE                    (1U << 24) /* Reverse sub pixel order */
#define LCDC_SPI3_EN                              (1U << 23) /* When set to 1, SPI 3-wire interface is enabled */
#define LCDC_SPI4_EN                              (1U << 22) /* When set to 1, SPI 4-wire interface is enabled */
#define LCDC_DBIB_BACK_PRESSURE_EN                (1U << 21) /* When set to 1, Enables back-pressure for DBI Type-B interface */
#define LCDC_SPI_CLK_PHASE                        (1U << 20) /* Sets SPI Clock Phase */
#define LCDC_SPI_CLK_POLARITY                     (1U << 19) /* Sets SPI Clock Polarity */
#define LCDC_SPID_JDI                             (1U << 18) /* Enable JDI over SPI */
#define LCDC_CMD_DATA_AS_HEADER                   (1U << 17) /* When set to 1, command data are used as header of each line */
#define LCDC_BIT_ORDER_ADDR_INVERT                (1U << 16) /* When set to 1, inverts the bit-order of the horizontal line address (used along  */
#define LCDC_SPI_2BYTE_ADDR                       (1U << 15) /* When set to 1, two-byte address is sent with each horizontal line (SPI) */
#define LCDC_PIX_CLK_AT_DBIB_CLK                  (1U << 14) /* When set to 1, expose pixel generation clock on the DBIB_CLK */
#define LCDC_EXT_CTRL_EN                          (1U << 13) /* When set to 1, enables the external control */
#define LCDC_HORIZONTAL_BLANK_EN                  (1U << 12) /* When set to 1, enables the horizontal blanking */
#define LCDC_DUAL_SPI_SUBPIXEL_EXTRACT_EN         (1U << 11) /* When set to 1, Enables DualSPI sub-pixel transaction */
#define LCDC_QUAD_SPI_EN                          (1U << 10) /* When set to 1, Enables QuadSPI */
#define LCDC_DUAL_SPI_EN                          (1U << 9) /* When set to 1, Enables DualSPI */
#define LCDC_DBIB_INTERFACE_WIDTH_MASK            (0x7 << 6) /* Set DBI Type-B interface width (8, 9 or 16 bits) and the serial interface: 0x0:  */
#define LCDC_DBIB_INTERFACE_WIDTH_POS             (6) /* Set DBI Type-B interface width (8, 9 or 16 bits) and the serial interface: 0x0:  */
#define LCDC_DBIB_DATA_ORDER_MASK                 (0x7 << 3) /* Set the data order of the 8-bit data word: 0x0: option 0 0x1: option 1 0x2: opti */
#define LCDC_DBIB_DATA_ORDER_POS                  (3) /* Set the data order of the 8-bit data word: 0x0: option 0 0x1: option 1 0x2: opti */
#define LCDC_DBIB_COLOR_FMT_MASK                  (0x7 << 0) /* Defines the output format and depends of the type of the output interface. For t */
#define LCDC_DBIB_COLOR_FMT_POS                   (0) /* Defines the output format and depends of the type of the output interface. For t */

/* LCDC_DBIB_CMD Register */

