AlmAck/svdtonuttx/demo/h/da1470x_lcdc.h
#define LCDC_PART_UPDATE                          (1U << 31) /* When set to 0, indicates that the command data are the Base address for partial  */
#define LCDC_DBIB_CMD_SEND                        (1U << 30) /* Send command to the DBI interface */
#define LCDC_CMD_WIDTH_MASK                       (0x3 << 28) /* Determine the command width. Applicable only on the QuadSPI 0x00: 1 Byte 0x01: 2 */
#define LCDC_CMD_WIDTH_POS                        (28) /* Determine the command width. Applicable only on the QuadSPI 0x00: 1 Byte 0x01: 2 */
#define LCDC_QSPI_SERIAL_CMD_TRANS                (1U << 27) /* When sets to 1, switch to serial transmission of the command. Applicable only fo */
#define LCDC_RD_MODE_EN                           (1U << 26) /* When sets to 1, read mode is enabled */
#define LCDC_FMTCTRL_EXPOSE_SETTING               (1U << 25) /* When sets to 1, FMTCTRL[15:8] is exposed on DBIB_CT pins and FMTCTRL[31] on DBIB */
#define LCDC_ST_INT_CMD_TYPE                      (1U << 24) /* When sets to 1, store internally a command type which is transmitted at the begg */
#define LCDC_DBIB_CMD_VAL_MASK                    (0xFFFF << 0) /* Data to send to the DBI interface */
#define LCDC_DBIB_CMD_VAL_POS                     (0) /* Data to send to the DBI interface */

/* LCDC_DBIB_RDAT Register */

#define LCDC_DBIB_RDAT_MASK                       (0xFFFFFFFF << 0) /* On Write: 31-30 bits: Specify the number of read cycles 0x0: 8 cycles 0x1: 16 cy */
#define LCDC_DBIB_RDAT_POS                        (0) /* On Write: 31-30 bits: Specify the number of read cycles 0x0: 8 cycles 0x1: 16 cy */

/* LCDC_FMTCTRL_2 Register */

#define LCDC_FMTCTRL_2_MASK                       (0xFFFFFFFF << 0) /* Bits Description When DBI-Type B Interface is selected: Bits Description 31-16 b */
#define LCDC_FMTCTRL_2_POS                        (0) /* Bits Description When DBI-Type B Interface is selected: Bits Description 31-16 b */

/* LCDC_FMTCTRL_3 Register */

#define LCDC_XRST_HIGH_STATE_MASK                 (0x3FF << 0) /* Set the high state of XRST signal in multiple of VCK */
#define LCDC_XRST_HIGH_STATE_POS                  (0) /* Set the high state of XRST signal in multiple of VCK */

/* LCDC_FMTCTRL Register */

#define LCDC_FMTCTRL_MASK                         (0xFFFFFFFF << 0) /* When DBI-Type B Interface is selected: Bits Description 31-22 bits: Reserved 21- */
#define LCDC_FMTCTRL_POS                          (0) /* When DBI-Type B Interface is selected: Bits Description 31-22 bits: Reserved 21- */

/* LCDC_FRONTPORCHXY Register */

#define LCDC_FPORCH_X_MASK                        (0xFFFF << 16) /* Front porch X (pixel clocks) */
#define LCDC_FPORCH_X_POS                         (16) /* Front porch X (pixel clocks) */
#define LCDC_FPORCH_Y_MASK                        (0xFFFF << 0) /* Front porch Y (lines) */
#define LCDC_FPORCH_Y_POS                         (0) /* Front porch Y (lines) */

/* LCDC_GPIO Register */

#define LCDC_DPI_CM_ASSERT                        (1U << 16) /* Assert DPI-2 Color Mode signal */
#define LCDC_DPI_SD_ASSERT                        (1U << 15) /* Assert DPI-2 Shutdown signal */
#define LCDC_GPIO_SPI_SI_ON_SD_PAD                (1U << 5) /* Enable to have the SPI SI on the SPI SD pad */
#define LCDC_GPIO_OUTPUT_MODE_MASK                (0x3 << 3) /* Select the mode that should be mapped on the GPIO pins 0x0 = JDI 0x1 = DPI 0x2 = */
#define LCDC_GPIO_OUTPUT_MODE_POS                 (3) /* Select the mode that should be mapped on the GPIO pins 0x0 = JDI 0x1 = DPI 0x2 = */
#define LCDC_GPIO_OUTPUT_EN                       (1U << 2) /* Enable the GPIO pins for LCDC control. The GPIO_OUTPUT_MODE is used to define wh */
#define LCDC_TE_INV                               (1U << 1) /* Applies an inversion on the TE (tearing effect) signal. 0 : the inversion is not */

/* LCDC_IDREG Register */

#define LCDC_LCDC_ID_MASK                         (0xFFFFFFFF << 0) /* Identification register */
#define LCDC_LCDC_ID_POS                          (0) /* Identification register */

/* LCDC_INTERRUPT Register */

#define LCDC_IRQ_TRIGGER_SEL                      (1U << 31) /* IRQ trigger control 0: Level triggering 1: Edge triggering In the case of the le */
#define LCDC_FE_IRQ_EN                            (1U << 4) /* Frame end interrupt enabled */
#define LCDC_TE_IRQ_EN                            (1U << 3) /* Tearing enable interrupt enabled */
#define LCDC_HSYNC_IRQ_EN                         (1U << 1) /* HSYNC interrupt enabled */
#define LCDC_VSYNC_IRQ_EN                         (1U << 0) /* VSYNC or TE interrupt enabled. See also the configuration bit LCDC_DBIB_CFG_REG[ */

/* LCDC_LAYER0_BASEADDR Register */

#define LCDC_L0_BASE_ADDR_MASK                    (0xFFFFFFFF << 0) /* Base Address of the frame buffer */
#define LCDC_L0_BASE_ADDR_POS                     (0) /* Base Address of the frame buffer */

/* LCDC_LAYER0_MODE Register */

#define LCDC_L0_EN                                (1U << 31) /* Enable layer. 0 : disable 1 : enable */
#define LCDC_L0_FORCE_ALPHA                       (1U << 30) /* When set to 1, force alpha with global alpha */
#define LCDC_L0_PREMUL_IMG_ALPHA                  (1U << 28) /* When set to 1, premultiply image alpha is enabled */
#define LCDC_L0_ASSERT_HLOCK_DMA                  (1U << 27) /* When set to 1, HLOCK signal on AHB DMAs is asserted */
#define LCDC_L0_ALPHA_MASK                        (0xFF << 16) /* Alpha layer global value (0x00-0xFF range) */
#define LCDC_L0_ALPHA_POS                         (16) /* Alpha layer global value (0x00-0xFF range) */
#define LCDC_L0_DST_BLEND_MASK                    (0xF << 12) /* Destinary Blending Function 0000: BLEND ZERO 0001: BLEND ONE 0010: BLEND ALPHA S */
#define LCDC_L0_DST_BLEND_POS                     (12) /* Destinary Blending Function 0000: BLEND ZERO 0001: BLEND ONE 0010: BLEND ALPHA S */
#define LCDC_L0_SRC_BLEND_MASK                    (0xF << 8) /* Source Blending Function 0000: BLEND ZERO 0001: BLEND ONE 0010: BLEND ALPHA SRC  */
#define LCDC_L0_SRC_BLEND_POS                     (8) /* Source Blending Function 0000: BLEND ZERO 0001: BLEND ONE 0010: BLEND ALPHA SRC  */
#define LCDC_L0_COLOR_MODE_MASK                   (0x1F << 0) /* Color Mode: 00001: 16-bit RGBX5551 color format, 00010: 32-bit RGBX8888 color fo */
#define LCDC_L0_COLOR_MODE_POS                    (0) /* Color Mode: 00001: 16-bit RGBX5551 color format, 00010: 32-bit RGBX8888 color fo */

/* LCDC_LAYER0_RESXY Register */

#define LCDC_L0_RES_X_MASK                        (0xFFFF << 16) /* Resolution X (Resolution of layer in pixels) */
#define LCDC_L0_RES_X_POS                         (16) /* Resolution X (Resolution of layer in pixels) */
#define LCDC_L0_RES_Y_MASK                        (0xFFFF << 0) /* Resolution Y (Resolution of layer in pixels) */
#define LCDC_L0_RES_Y_POS                         (0) /* Resolution Y (Resolution of layer in pixels) */

/* LCDC_LAYER0_SIZEXY Register */

#define LCDC_L0_SIZE_X_MASK                       (0xFFFF << 16) /* Size X (Size of layer in pixels) */
#define LCDC_L0_SIZE_X_POS                        (16) /* Size X (Size of layer in pixels) */
#define LCDC_L0_SIZE_Y_MASK                       (0xFFFF << 0) /* Size Y (Size of layer in pixels) */
#define LCDC_L0_SIZE_Y_POS                        (0) /* Size Y (Size of layer in pixels) */

/* LCDC_LAYER0_STARTXY Register */

#define LCDC_L0_START_X_MASK                      (0xFFFF << 16) /* Start X (offset pixels) */
#define LCDC_L0_START_X_POS                       (16) /* Start X (offset pixels) */
#define LCDC_L0_START_Y_MASK                      (0xFFFF << 0) /* Start Y (offset pixels) */
#define LCDC_L0_START_Y_POS                       (0) /* Start Y (offset pixels) */

/* LCDC_LAYER0_STRIDE Register */

