AlmAck/svdtonuttx/demo/h/da1470x_lcdc.h
#define LCDC_L0_DMA_PREFETCH_MASK                 (0x7 << 25) /* Specify the DMA prefetch Level in layer 0 * 0x000 : 0 DMA rows (default) * 0x001 */
#define LCDC_L0_DMA_PREFETCH_POS                  (25) /* Specify the DMA prefetch Level in layer 0 * 0x000 : 0 DMA rows (default) * 0x001 */
#define LCDC_L0_FIFO_THR_MASK                     (0x3 << 19) /* Layer dma fifo threshold burst start 00: half fifo (default) 01: 2 burst size 10 */
#define LCDC_L0_FIFO_THR_POS                      (19) /* Layer dma fifo threshold burst start 00: half fifo (default) 01: 2 burst size 10 */
#define LCDC_L0_NO_16BEAT_BURST                   (1U << 16) /* When set to 1 forbids INCR16 bursts in layer 0 */
#define LCDC_L0_STRIDE_MASK                       (0xFFFF << 0) /* Layer Stride (distance from line to line in bytes) */
#define LCDC_L0_STRIDE_POS                        (0) /* Layer Stride (distance from line to line in bytes) */

/* LCDC_LAYER1_BASEADDR Register */

#define LCDC_L1_BASE_ADDR_MASK                    (0xFFFFFFFF << 0) /* Base Address of the frame buffer */
#define LCDC_L1_BASE_ADDR_POS                     (0) /* Base Address of the frame buffer */

/* LCDC_LAYER1_MODE Register */

#define LCDC_L1_EN                                (1U << 31) /* Enable layer. 0 : disable 1 : enable */
#define LCDC_L1_FORCE_ALPHA                       (1U << 30) /* When set to 1, force alpha with global alpha */
#define LCDC_L1_PREMUL_IMG_ALPHA                  (1U << 28) /* When set to 1, premultiply image alpha is enabled */
#define LCDC_L1_ASSERT_HLOCK_DMA                  (1U << 27) /* When set to 1, HLOCK signal on AHB DMAs is asserted */
#define LCDC_L1_ALPHA_MASK                        (0xFF << 16) /* Alpha layer global value (0x00-0xFF range) */
#define LCDC_L1_ALPHA_POS                         (16) /* Alpha layer global value (0x00-0xFF range) */
#define LCDC_L1_DST_BLEND_MASK                    (0xF << 12) /* Destinary Blending Function 0000: BLEND ZERO 0001: BLEND ONE 0010: BLEND ALPHA S */
#define LCDC_L1_DST_BLEND_POS                     (12) /* Destinary Blending Function 0000: BLEND ZERO 0001: BLEND ONE 0010: BLEND ALPHA S */
#define LCDC_L1_SRC_BLEND_MASK                    (0xF << 8) /* Source Blending Function 0000: BLEND ZERO 0001: BLEND ONE 0010: BLEND ALPHA SRC  */
#define LCDC_L1_SRC_BLEND_POS                     (8) /* Source Blending Function 0000: BLEND ZERO 0001: BLEND ONE 0010: BLEND ALPHA SRC  */
#define LCDC_L1_COLOR_MODE_MASK                   (0x1F << 0) /* Color Mode: 00001: 16-bit RGBX5551 color format, 00010: 32-bit RGBX8888 color fo */
#define LCDC_L1_COLOR_MODE_POS                    (0) /* Color Mode: 00001: 16-bit RGBX5551 color format, 00010: 32-bit RGBX8888 color fo */

/* LCDC_LAYER1_RESXY Register */

#define LCDC_L1_RES_X_MASK                        (0xFFFF << 16) /* Resolution X (Resolution of layer in pixels) */
#define LCDC_L1_RES_X_POS                         (16) /* Resolution X (Resolution of layer in pixels) */
#define LCDC_L1_RES_Y_MASK                        (0xFFFF << 0) /* Resolution Y (Resolution of layer in pixels) */
#define LCDC_L1_RES_Y_POS                         (0) /* Resolution Y (Resolution of layer in pixels) */

/* LCDC_LAYER1_SIZEXY Register */

#define LCDC_L1_SIZE_X_MASK                       (0xFFFF << 16) /* Size X (Size of layer in pixels) */
#define LCDC_L1_SIZE_X_POS                        (16) /* Size X (Size of layer in pixels) */
#define LCDC_L1_SIZE_Y_MASK                       (0xFFFF << 0) /* Size Y (Size of layer in pixels) */
#define LCDC_L1_SIZE_Y_POS                        (0) /* Size Y (Size of layer in pixels) */

/* LCDC_LAYER1_STARTXY Register */

#define LCDC_L1_START_X_MASK                      (0xFFFF << 16) /* Start X (offset pixels) */
#define LCDC_L1_START_X_POS                       (16) /* Start X (offset pixels) */
#define LCDC_L1_START_Y_MASK                      (0xFFFF << 0) /* Start Y (offset pixels) */
#define LCDC_L1_START_Y_POS                       (0) /* Start Y (offset pixels) */

/* LCDC_LAYER1_STRIDE Register */

#define LCDC_L1_DMA_PREFETCH_MASK                 (0x7 << 25) /* Specify the DMA prefetch Level in layer 1 * 0x000 : 0 DMA rows (default) * 0x001 */
#define LCDC_L1_DMA_PREFETCH_POS                  (25) /* Specify the DMA prefetch Level in layer 1 * 0x000 : 0 DMA rows (default) * 0x001 */
#define LCDC_L1_FIFO_THR_MASK                     (0x3 << 19) /* Layer dma fifo threshold burst start 00: half fifo (default) 01: 2 burst size 10 */
#define LCDC_L1_FIFO_THR_POS                      (19) /* Layer dma fifo threshold burst start 00: half fifo (default) 01: 2 burst size 10 */
#define LCDC_L1_NO_16BEAT_BURST                   (1U << 16) /* When set to 1 forbids INCR16 bursts in layer 1 */
#define LCDC_L1_STRIDE_MASK                       (0xFFFF << 0) /* Layer Stride (distance from line to line in bytes) */
#define LCDC_L1_STRIDE_POS                        (0) /* Layer Stride (distance from line to line in bytes) */

/* LCDC_MODE Register */

#define LCDC_MODE_EN                              (1U << 31) /* Mode register. 0 : disable 1 : enable */
#define LCDC_VSYNC_POL                            (1U << 28) /* VSYNC polarity. 0: positive 1: negative */
#define LCDC_HSYNC_POL                            (1U << 27) /* HSYNC polarity. 0: positive 1: negative */
#define LCDC_DE_POL                               (1U << 26) /* DE polarity. 0: positive 1: negative */
#define LCDC_DITH_MODE_MASK                       (0x3 << 24) /* 0x00: Dithering is disabled 0x01: Dithering 18-bits mode 0x02: Dithering 16-bits */
#define LCDC_DITH_MODE_POS                        (24) /* 0x00: Dithering is disabled 0x01: Dithering 18-bits mode 0x02: Dithering 16-bits */
#define LCDC_VSYNC_SCPL                           (1U << 23) /* Set VSYNC for a single cycle per line. 0: disable 1: enable */
#define LCDC_PIXCLKOUT_POL                        (1U << 22) /* Pixel clock out polarity. 0: positive 1: negative */
#define LCDC_GLOBAL_GAMMA_EN                      (1U << 20) /* When set to 1, global gamma correction is enabled */
#define LCDC_FORCE_BLANK                          (1U << 19) /* Forces output to blank. 0: disable 1: enable */
#define LCDC_UNDERRUN_PREVENTION_EN               (1U << 18) /* When set to 1, underrun prevention is enabled for interfaces that support this */
#define LCDC_SFRAME_UPD                           (1U << 17) /* Single frame update. 0: disable 1: enable */
#define LCDC_DPI2_CONFIG_MASK                     (0x7 << 12) /* Defines MIPI DPI-2 Configuration 0x00: RGB888 24-bits 0x01: RGB666 18-bits Confi */
#define LCDC_DPI2_CONFIG_POS                      (12) /* Defines MIPI DPI-2 Configuration 0x00: RGB888 24-bits 0x01: RGB666 18-bits Confi */
#define LCDC_PIXCLKOUT_SEL                        (1U << 11) /* Selects the pixel out clock for the display. 0: based on the pixel pipeline cloc */
#define LCDC_OUT_MODE_MASK                        (0xF << 5) /* Selection of the output mode 0000: Parallel RGB 1000: JDI MIP All the other valu */
#define LCDC_OUT_MODE_POS                         (5) /* Selection of the output mode 0000: Parallel RGB 1000: JDI MIP All the other valu */
#define LCDC_DBIB_OFF                             (1U << 4) /* When set to 0, DBI Type-B interface is enabled */
#define LCDC_FORM_OFF                             (1U << 3) /* Formating off 0: disabled 1: enabled */
#define LCDC_DSCAN                                (1U << 1) /* Double horizontal scan 0: disabled 1: enabled */
#define LCDC_TMODE                                (1U << 0) /* Test mode 0: disabled 1: enabled */

/* LCDC_PALETTE_255 Register */

#define LCDC_PALLETE_R_MASK                       (0xFF << 16) /* Gamma ramp red bits */
#define LCDC_PALLETE_R_POS                        (16) /* Gamma ramp red bits */
#define LCDC_PALLETE_G_MASK                       (0xFF << 8) /* Gamma ramp green bits */
#define LCDC_PALLETE_G_POS                        (8) /* Gamma ramp green bits */
#define LCDC_PALLETE_B_MASK                       (0xFF << 0) /* Gamma ramp blue bits */
#define LCDC_PALLETE_B_POS                        (0) /* Gamma ramp blue bits */

/* LCDC_PALETTE_BASE Register */

#define LCDC_PALLETE_R_MASK                       (0xFF << 16) /* Gamma ramp red bits */
#define LCDC_PALLETE_R_POS                        (16) /* Gamma ramp red bits */
#define LCDC_PALLETE_G_MASK                       (0xFF << 8) /* Gamma ramp green bits */
#define LCDC_PALLETE_G_POS                        (8) /* Gamma ramp green bits */
#define LCDC_PALLETE_B_MASK                       (0xFF << 0) /* Gamma ramp blue bits */
#define LCDC_PALLETE_B_POS                        (0) /* Gamma ramp blue bits */

/* LCDC_RESXY Register */

#define LCDC_RES_X_MASK                           (0xFFFF << 16) /* Resolution X in pixels. */
#define LCDC_RES_X_POS                            (16) /* Resolution X in pixels. */
#define LCDC_RES_Y_MASK                           (0xFFFF << 0) /* Resolution Y in pixels. */
#define LCDC_RES_Y_POS                            (0) /* Resolution Y in pixels. */

/* LCDC_STARTXY Register */

#define LCDC_START_X_MASK                         (0xFFFF << 16) /* Specify framess X dimension */
#define LCDC_START_X_POS                          (16) /* Specify framess X dimension */
#define LCDC_START_Y_MASK                         (0xFFFF << 0) /* Specify framess Y dimension */
#define LCDC_START_Y_POS                          (0) /* Specify framess Y dimension */

/* LCDC_STATUS Register */

#define LCDC_SPI_RD_WR_OP                         (1U << 16) /* Indicates read/write operation on SPI */
#define LCDC_DBIB_CMD_FIFO_FULL                   (1U << 15) /* Indicates if the command FIFO is full */
#define LCDC_DBI_SPI_CS                           (1U << 14) /* Indicates DBI/SPI CS status */
#define LCDC_FRAME_END                            (1U << 13) /* Frame end (active high) */
#define LCDC_DBIB_OUT_TRANS_PENDING               (1U << 12) /* Pending output transaction in DBI Type-B interface */
#define LCDC_DBIB_CMD_PENDING                     (1U << 11) /* Transferring of command in progress. 0: idle 1: in progress */
#define LCDC_DBIB_DATA_PENDING                    (1U << 10) /* Pending RGB data in DBI Type-B interface */
#define LCDC_DBIB_TE                              (1U << 8) /* The DBIB tearing effect signal */
#define LCDC_STICKY_UNDERFLOW                     (1U << 7) /* Sticky underflow(clear with write in the LCDC_INTERRUPT_REG) 0: There is no unde */
#define LCDC_UNDERFLOW                            (1U << 6) /* Underflow on the current transfer. 0: There is no underflow 1: Underflow has bee */
#define LCDC_LAST_ROW                             (1U << 5) /* Last row (Last row is currently displayed) */
#define LCDC_STAT_CSYNC                           (1U << 4) /* CSYNC signal level */
#define LCDC_STAT_VSYNC                           (1U << 3) /* VSYNC signal level */
#define LCDC_STAT_HSYNC                           (1U << 2) /* HSYNC signal level */
#define LCDC_STAT_DE                              (1U << 1) /* Indicates the DE signal status (0 or 1) at the current time of reading */
#define LCDC_STAT_ACTIVE                          (1U << 0) /* Active (When not in vertical blanking) */

#endif /* __DA1470X_LCDC_H */
